# vstAddPDMenuMode

## Description
```pascal
PROCEDURE vstAddPDMenuMode(label : STRING);
```

```python

def vs.vstAddPDMenuMode(label):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|label|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events